// Скільки виділяють основних HTTP МЕТОДІВ ДЛЯ РОБОТИ З REST сервісом? 5 (POST, GET, PUT, PATCH, DELETE)
// Яку операцію означає літера "С" в абревіатурі CRUD? Створення
// Який HTTP метод відповідає операції створення (надсилання) даних? POST
// Яку операцію означає літера "R" в абревіатурі CRUD? Читання
// Який HTTP метод відповідає операції читання (отримання) даних? GET
// Яку операцію означає літера "U" в абревіатурі CRUD? Зміна
// Який HTTP метод відповідає операції оновлення даних? PUT, PATCH
// Яку операцію означає літера "D" в абревіатурі CRUD? Видалення
// Який HTTP метод відповідає операції видалення даних? DELETE
// Який запит виконується якщо не вказати метод у fetch()? GET
// fetch("https://my-api.com")
//     .then(res => res.json())
//     .then(value => console.log(value))
//     .catch(error => console.log(error));
// Як змінити HTTP метод під час виконання функції fetch()? У властивості method об'єкта параметрів функції fetch()
// Яку роль виконує тіло  HTTP запиту? Додатковий блок запиту, який містить дані
// Headers - Дозволяє клієнту передвати службову інформацію про запит 
// method - Визначає яку операцію виконувати 
// Чи виконається такий HTTP запит успішно? FALSE, використовується об'єкт, потрібно перевести JSON
// fetch("https://my-api.com/login", {
//     method: "POST",
//     body: {
//         username: "mango@mail.com",
//         password: 12345
//     }
// }); 